---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.MultiPlanarDepth
source: html/1d2db0fa-9f4b-d00b-2413-ae893ac8ded1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.MultiPlanarDepth Property

Multi-planar depth of Rebar Shape can't be too small.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultiPlanarDepth { get; }
```